{
  "architectures": [
    "Llama4ForCausalLMEagle3"
  ],
  "bos_token_id": 200000,
  "eos_token_id": [
    200001,
    200007,
    200008
  ],
  "hidden_act": "silu",
  "hidden_size": 5120,
  "initializer_range": 0.02,
  "interleave_moe_layer_step": 2,
  "intermediate_size": 8192,
  "intermediate_size_mlp": 16384,
  "max_position_embeddings": 1048576,
  "model_type": "llama4_text",
  "num_attention_heads": 40,
  "num_experts_per_tok": 1,
  "num_hidden_layers": 1,
  "num_key_value_heads": 8,
  "num_local_experts": 128,
  "pad_token_id": 200018,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 500000.0,
  "torch_dtype": "bfloat16",
  "use_cache": true,
  "use_qk_norm": false,
  "vocab_size": 202048,
  "draft_vocab_size": 32000,
  "target_hidden_size": 5120,
  "tie_word_embeddings": false,
  "head_dim": 128,
  "attention_dropout": 0.0,
  "attn_temperature_tuning": false,
  "floor_scale": 1.0,
  "attn_scale": 1.0
} 